/*
*4.最优雷达设置问题（贪心算法） 
*【问题描述】假设海岸线可视为一条直线，一边为大海，一边为大陆，岛屿可看作一个点，雷达的监控范围为一个半径为 d 的圆。
* 为方便表示，使用笛卡尔坐标系，令海岸线为 X轴，X 轴上方为大海，X 轴下方为大陆，所有岛屿的位置都由坐标给出。
* 可将岛屿坐标作为圆心，以半径 d 画圆,如果圆与 X 轴没有交点，就无法覆盖岛屿；
* 如果圆与 X 轴的交点为 a,b,雷达放到 a、b 之间那就是可以将该岛屿覆盖住。
* 给定每个岛屿的位置，以及雷达的监控半径，请设计算法，编写程序找出覆盖所有岛屿的雷达安装的最小数量。
*【输入】有多组测试数据，第 1 行给出岛屿的数目 n(1<=n<=1000)和雷达监控范围 d，接下来 n 行输入第 i 个岛屿的 X 坐标和 Y 坐标，当 n 和 d 都是零时结束。
* 
- 5 -
* 【输出】每组测试数据输出一行，要包括样例的编号和最小雷达安装数，如
* 果无法覆盖所有岛屿，输出“-1”。
* 【输入样例】
2 5
-3 4
-6 3
4 5
-5 3
-3 5
2 3
3 3
0 0
* 【输出样例】
Case 1: 1
Case 2: 2
*/

#include <iostream>
using namespace std;

int main(){





	return 0;
}